---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotSlopeReferenceIsVertical
source: html/34044f56-058e-b55d-ed02-06dad4dfffe6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotSlopeReferenceIsVertical Property

The highlighted Spot Slope references an element that is vertical.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpotSlopeReferenceIsVertical { get; }
```